Repository: watzon/NeoCode
Catalog: NeoCode/Localization/Localizable.xcstrings
Source language: en
Languages: es, fr, it, pt

source: The agent wants to continue after repeated failed attempts.
es: El agente quiere continuar tras varios intentos fallidos.
fr: L'agent souhaite continuer après plusieurs tentatives infructueuses.
it: L'agente vuole continuare dopo ripetuti tentativi falliti.
pt: O agente quer continuar após repetidas tentativas falhas.

source: The build currently running on this Mac.
es: La compilacion que se esta ejecutando actualmente en esta Mac.
fr: La build actuellement exécutée sur ce Mac.
it: La build attualmente in esecuzione su questo Mac.
pt: A compilação atualmente em execução neste Mac.

source: The most recent time this Mac finished talking to the release feed.
es: La ultima vez que esta Mac termino de consultar el feed de versiones.
fr: La dernière fois que ce Mac a communiqué avec le flux de releases.
it: L'ultima volta che questo Mac ha terminato la comunicazione con il feed delle release.
pt: A última vez que este Mac terminou de conversar com o feed de lançamentos.

source: The newest signed release Sparkle has found for this channel.
es: La version firmada mas reciente que Sparkle encontro para este canal.
fr: La dernière release signée trouvée par Sparkle pour ce canal.
it: L'ultima release firmata che Sparkle ha trovato per questo canale.
pt: A versão assinada mais recente que o Sparkle encontrou para este canal.

source: Theme
es: Tema
fr: Thème
it: Tema
pt: Tema

source: Theme, fonts, and interface styling.
es: Tema, fuentes y estilo de la interfaz.
fr: Thème, polices et style d'interface.
it: Tema, font e stile dell'interfaccia.
pt: Tema, fontes e estilo da interface.

source: This matches the TUI behavior: the transcript rewinds, the prompt comes back into the composer, and file edits after that point are rolled back.
es: Esto coincide con el comportamiento del TUI: la transcripcion retrocede, el prompt vuelve al compositor y los cambios de archivos posteriores a ese punto se revierten.
fr: Cela reflète le comportement du TUI : la transcription revient en arrière, le prompt revient dans le compositeur et les modifications de fichiers après ce point sont annulées.
it: Questo corrisponde al comportamento dell'interfaccia testuale: la trascrizione si riavvolge, il prompt torna nel compositore e le modifiche ai file dopo quel punto vengono annullate.
pt: Isso corresponde ao comportamento TUI: a transcrição retrocede, o prompt volta ao compositor e as edições de arquivos após esse ponto são revertidas.

source: This removes this prompt and %@ later %@ from the transcript and restores it to the composer.
es: Esto elimina este prompt y %@ %@ posteriores de la transcripción y lo devuelve al compositor.
fr: Cela supprime cette invite ainsi que %@ %@ supplémentaires de la transcription et la replace dans le compositeur.
it: Questo rimuove questo prompt e %@ %@ successivi dalla trascrizione e lo ripristina nel compositore.
pt: Isso remove este prompt e %@ %@ posteriores da transcrição e o restaura no compositor.

source: This removes this prompt from the transcript and restores it to the composer.
es: Esto elimina este prompt de la transcripción y lo devuelve al compositor.
fr: Cela supprime cette invite de la transcription et la replace dans le compositeur.
it: Questo rimuove questo prompt dalla trascrizione e lo ripristina nel compositore.
pt: Isso remove este prompt da transcrição e o restaura no compositor.

source: Threads
es: Hilos
fr: Conversations
it: Conversazioni
pt: Conversas

source: Toggle YOLO
es: Alternar YOLO
fr: Basculer YOLO
it: Attiva/disattiva YOLO
pt: Alternar YOLO

source: Token Breakdown
es: Desglose de tokens
fr: Répartition des jetons
it: Dettaglio token
pt: Detalhamento de tokens

source: Tool Activity
es: Actividad de herramientas
fr: Activité des outils
it: Attività strumento
pt: Atividade de ferramenta

source: Total tokens
es: Tokens totales
fr: Total des jetons
it: Token totali
pt: Total de tokens

source: Tune how prompts send and whether NeoCode should keep per-thread drafts waiting for you when you come back.
es: Ajusta como se envian los mensajes y si NeoCode debe conservar borradores por hilo para cuando vuelvas.
fr: Ajustez la façon dont les prompts sont envoyés et si NeoCode doit conserver les brouillons par conversation lorsque vous revenez.
it: Regola come inviano i prompt e se NeoCode deve mantenere le bozze per thread in attesa quando torni.
pt: Ajuste como os prompts são enviados e se o NeoCode deve manter os rascunhos por conversa aguardando você quando voltar.

source: UI font
es: Fuente de interfaz
fr: Police d'interface
it: Font interfaccia
pt: Fonte da interface

source: UI font size
es: Tamano de fuente de interfaz
fr: Taille de police d'interface
it: Dimensione font interfaccia
pt: Tamanho da fonte da interface

source: Unavailable
es: No disponible
fr: Indisponible
it: Non disponibile
pt: Indisponível

source: Up to date
es: Actualizado
fr: À jour
it: Aggiornato
pt: Atualizado

source: Update available
es: Actualización disponible
fr: Mise à jour disponible
it: Aggiornamento disponibile
pt: Atualização disponível

source: Update available: %@
es: Actualización disponible: %@
fr: Mise à jour disponible : %@
it: Aggiornamento disponibile: %@
pt: Atualização disponível: %@

source: Update error
es: Error de actualización
fr: Erreur de mise à jour
it: Errore di aggiornamento
pt: Erro de atualização

source: Updated %@
es: Actualizado %@
fr: Mis à jour %@
it: Aggiornato %@
pt: Atualizado %@

source: Updates
es: Actualizaciones
fr: Mises à jour
it: Aggiornamenti
pt: Atualizações

source: Usage
es: Uso
fr: Utilisation
it: Utilizzo
pt: Uso

source: Usage in last %@
es: Uso en los ultimos %@
fr: Utilisation au cours des %@ derniers
it: Utilizzo negli ultimi %@
pt: Uso nos últimos %@

source: Use pointer cursors
es: Usar cursores de puntero
fr: Utiliser les curseurs pointeur
it: Usa cursori puntatore
pt: Usar cursores de ponteiro

source: Use the folder button in the Threads sidebar to add a workspace. NeoCode will build your dashboard from the sessions it discovers there.
es: Usa el boton de carpeta en la barra lateral de Hilos para anadir un espacio de trabajo. NeoCode construira tu panel con las sesiones que encuentre alli.
fr: Utilisez le bouton dossier dans la barre latérale Conversations pour ajouter un espace de travail. NeoCode construira votre tableau de bord à partir des sessions qu'il y découvre.
it: Usa il pulsante a forma di cartella nella barra laterale Conversazioni per aggiungere uno spazio di lavoro. NeoCode costruirà la dashboard dalle sessioni che trova lì.
pt: Use o botão de pasta na barra lateral de conversas para adicionar um espaço de trabalho. O NeoCode construirá seu painel a partir das sessões que encontrar lá.

source: Used for labels, navigation, settings, and conversation chrome in this theme.
es: Se usa para etiquetas, navegacion, ajustes y elementos de conversacion en este tema.
fr: Utilisé pour les étiquettes, la navigation, les paramètres et le chrome des conversations dans ce thème.
it: Usato per etichette, navigazione, impostazioni e chrome delle conversazioni in questo tema.
pt: Usado para rótulos, navegação, configurações e a moldura da conversa neste tema.

source: Used for transcript code, diffs, file references, and inline code in this theme.
es: Se usa para codigo en transcripciones, diffs, referencias de archivos y codigo en linea en este tema.
fr: Utilisé pour le code de transcription, les diffs, les références aux fichiers et le code inline dans ce thème.
it: Usato per il codice della trascrizione, i diff, i riferimenti ai file e il codice inline in questo tema.
pt: Usado para código da transcrição, diffs, referências de arquivo e código inline neste tema.

source: Used when a project does not already have its own preferred editor or destination.
es: Se usa cuando un proyecto todavia no tiene su propio editor o destino preferido.
fr: Utilisé lorsqu'un projet n'a pas encore son éditeur ou destination préféré.
it: Usato quando un progetto non ha già un editor o una destinazione preferita.
pt: Usado quando um projeto ainda não tem seu editor ou destino preferido.

source: Version %@ is ready to download. Use the blue titlebar control or the action below when you want to start it.
es: La versión %@ está lista para descargarse. Usa el control azul de la barra de título o la acción inferior cuando quieras empezar.
fr: La version %@ est prête à être téléchargée. Utilisez le contrôle bleu dans la barre de titre ou l'action ci-dessous lorsque vous voulez démarrer.
it: La versione %@ è pronta per il download. Usa il controllo blu nella barra del titolo o l'azione qui sotto quando vuoi iniziare.
pt: A versão %@ está pronta para download. Use o controle azul na barra de título ou a ação abaixo quando quiser começar.

source: Version %@ is staged and ready. Install it when you are ready to relaunch NeoCode.
es: La versión %@ está preparada y lista. Instálala cuando estés listo para reiniciar NeoCode.
fr: La version %@ est prête. Installez-la lorsque vous êtes prêt à relancer NeoCode.
it: La versione %@ è pronta. Installala quando sei pronto a riavviare NeoCode.
pt: A versão %@ está pronta. Instale-a quando estiver pronto para reiniciar o NeoCode.

source: Warm daylight palette for your brighter workspace.
es: Paleta calida de luz diurna para un espacio de trabajo mas luminoso.
fr: Palette de lumière du jour chaude pour votre espace de travail plus lumineux.
it: Palette diurna calda per il tuo spazio di lavoro più luminoso.
pt: Paleta quente de luz do dia para seu espaço de trabalho mais claro.

source: Watching for releases
es: Observando nuevas versiones
fr: Surveillance des versions
it: Monitoraggio degli aggiornamenti
pt: Monitorando novas versões

source: Welcome to NeoCode!
es: Bienvenido a NeoCode!
fr: Bienvenue sur NeoCode!
it: Benvenuto in NeoCode!
pt: Bem-vindo ao NeoCode!

source: Write a custom response
es: Escribir una respuesta personalizada
fr: Écrire une réponse personnalisée
it: Scrivi una risposta personalizzata
pt: Escrever uma resposta personalizada

source: YOLO mode
es: Modo YOLO
fr: Mode YOLO
it: Modalità YOLO
pt: Modo YOLO

source: You are already running the newest compatible signed release available from the appcast feed.
es: Ya estás usando la versión firmada compatible más reciente disponible en el feed appcast.
fr: Vous utilisez déjà la version signée compatible la plus récente disponible dans le flux appcast.
it: Stai già usando la versione firmata compatibile più recente disponibile nel feed appcast.
pt: Você já está usando a versão assinada compatível mais recente disponível no feed appcast.

# %@ tokens · %@
source: %1$@ tokens · %2$@
fr: %1$@ jetons · %2$@
it: %1$@ token · %2$@

source: Add
fr: Ajouter
it: Aggiungi
pt: Adicionar

source: Add your first project
fr: Ajoutez votre premier projet
it: Aggiungi il tuo primo progetto
pt: Adicione seu primeiro projeto

source: Back to bottom
fr: Retour en bas
it: Torna in fondo
pt: Voltar ao final

source: Cancel
fr: Annuler
it: Annulla
pt: Cancelar

source: Create a new thread or select one from the sidebar to begin chatting with the OpenCode runtime.
fr: Créez une nouvelle conversation ou sélectionnez-en une dans la barre latérale pour commencer à discuter avec le runtime OpenCode.
it: Crea una nuova conversazione o seleziona una dalla barra laterale per iniziare a chattare con il runtime OpenCode.
pt: Crie uma nova conversa ou selecione uma na barra lateral para começar a conversar com o tempo de execução OpenCode.

source: Edit
fr: Modifier
it: Modifica
pt: Editar

source: Error
fr: Erreur
it: Errore
pt: Erro

source: General
fr: Général
it: Generale
pt: Geral

source: Off
fr: Désactivé
it: Disattivato
pt: Desligado

source: On
fr: Activé
it: Attivato
pt: Ligado

source: Open Project
fr: Ouvrir le projet
it: Apri progetto
pt: Abrir projeto

source: prompt
fr: invite

source: prompts
fr: invites
it: prompt

# Queued %lld of %lld
source: Queued %1$lld of %2$lld
fr: En attente %1$lld sur %2$lld
it: In coda %1$lld di %2$lld
pt: Na fila %1$lld de %2$lld

source: Refresh Threads
fr: Actualiser les conversations
it: Aggiorna conversazioni
pt: Atualizar conversas

source: Remove
fr: Supprimer
it: Rimuovi
pt: Remover

source: Remove attachment
fr: Supprimer la pièce jointe
it: Rimuovi allegato
pt: Remover anexo

source: Rename Thread
fr: Renommer la conversation
it: Rinomina conversazione
pt: Renomear conversa

source: Reveal in Finder
fr: Afficher dans le Finder
it: Mostra nel Finder
pt: Mostrar no Finder

source: Revert
fr: Revenir
it: Annulla
pt: Reverter

source: Reverting...
fr: Restauration en cours...
it: Annullamento...
pt: Revertendo...

source: Start a thread
fr: Démarrer une conversation
it: Avvia una conversazione
pt: Começar uma conversa

source: Thread name
fr: Nom de la conversation
it: Nome conversazione
pt: Nome da conversa

source: Tokens
fr: Jetons
it: Token

source: Type your own answer
fr: Tapez votre propre réponse
it: Digita la tua risposta
pt: Digite sua própria resposta

source: Use custom
fr: Utiliser personnalisé
it: Usa personalizzato
pt: Usar personalizado

source: Use the project button in the Threads sidebar to add a folder. NeoCode will only show threads for projects you explicitly add.
fr: Utilisez le bouton projet dans la barre latérale Conversations pour ajouter un dossier. NeoCode n'affichera que les conversations des projets que vous ajoutez explicitement.
it: Usa il pulsante progetto nella barra laterale Conversazioni per aggiungere una cartella. NeoCode mostrerà solo le conversazioni per i progetti che aggiungi esplicitamente.
pt: Use o botão de projeto na barra lateral de conversas para adicionar uma pasta. O NeoCode mostrará apenas as conversas dos projetos que você adicionar explicitamente.

source: Question
it: Domanda
pt: Pergunta

source: Questions
it: Domande
pt: Perguntas
